//Task 2. Напишите программу, которая на вход принимает два числа и выдает,
//какое число больше, а какое меньше.
/*
Console.Write ("Input a first number: ");
int num1 = Convert.ToInt32 (Console.ReadLine());
Console.Write ("Input a second number: ");
int num2 = Convert.ToInt32 (Console.ReadLine());
if (num1 > num2)
{
    Console.WriteLine ("Max number is " + num1); 
    Console.WriteLine ("Min number is " + num2);
}
else
{
    Console.WriteLine ("Max number is " + num2);
    Console.WriteLine ("Min number is " + num1);
}
*/
//Task 4. Напишите в программу, которая принимает на вход три числа и выдает
//максимальное из этих чисел.

